import React from "react";
import SectionHeader from "../components/layout/SectionHeader";
import { useTranslation } from "react-i18next";
import { Link } from "react-router-dom";

const PrivacyPolicy = () => {
  const { t } = useTranslation();
  const backLinks = [
    {
      name: t("home"),
      path: "/"
    }
  ];
  return (
    <>
      <SectionHeader pageName={t("auth.privacyPolicy")} backLinks={backLinks} />
      <section className="terms_section">
        <div className="container">
          <div className="row">
            <div className="col-lg-9 col-12">
              <p>
                تحدد هذه السياسة كيفية جمعنا واستخدامنا وكشفنا وحمايتنا
                للمعلومات التي تقدمها عند استخدام منصتنا.
              </p>
              <h4>المعلومات التي نجمعها</h4>
              <ul>
                <li>
                  المعلومات الشخصية: عند التسجيل في حساب أو استخدام منصتنا، قد
                  نقوم بجمع معلومات شخصية مثل اسمك وعنوان بريدك الإلكتروني
                  ومعلومات الدفع.
                </li>
                <li>
                  معلومات الاستخدام: قد نجمع معلومات حول كيفية تفاعلك مع منصتنا،
                  بما في ذلك سجل تصفحك واستفسارات البحث ومعلومات الجهاز.
                </li>
              </ul>
              <h4>كيفية استخدام معلوماتك</h4>
              <p>قد نستخدم المعلومات التي نجمعها للأغراض التالية:</p>
              <ul>
                <li>لتوفير وصيانة منصتنا.</li>
                <li>لتخصيص تجربتك وتقديم محتوى مخصص.</li>
                <li>لمعالجة المدفوعات وتنفيذ طلباتك.</li>
                <li>
                  للتواصل معك حول التحديثات والعروض الترويجية وأخبار أخرى.
                </li>
                <li>لتحليل اتجاهات الاستخدام وتحسين منصتنا.</li>
              </ul>
              <h4>مشاركة المعلومات</h4>
              <p>
                نحن لا نبيع أو نتاجر أو ننقل معلوماتك الشخصية إلى أطراف ثالثة
                دون موافقتك، إلا كما هو موضح أدناه:
              </p>
              <ul>
                <li>
                  مقدمو الخدمات: قد نشارك معلوماتك مع مقدمي خدمات طرف ثالث
                  يساعدوننا في تشغيل منصتنا أو إجراء أعمالنا.
                </li>
                <li>
                  الامتثال للقانون: قد نكشف معلوماتك عندما يكون ذلك مطلوبًا
                  بموجب القانون أو لحماية حقوقنا أو حقوق الآخرين.
                </li>
              </ul>
              <h4>أمان البيانات</h4>
              <p>
                نتخذ تدابير معقولة لحماية المعلومات التي نجمعها من الوصول غير
                المصرح به أو الكشف أو التغيير أو الإتلاف.
              </p>
              <h4>روابط الطرف الثالث</h4>
              <p>
                منصتنا قد تحتوي على روابط إلى مواقع وخدمات طرف ثالث لا نملكها أو
                نتحكم فيها. لسنا مسؤولين عن ممارسات الخصوصية أو المحتوى لهذه
                الأطراف الثالثة.
              </p>
              <h4>خصوصية الأطفال</h4>
              <p>
                منصتنا ليست موجهة للأطفال دون سن الثالثة عشرة، ونحن لا نقوم بجمع
                المعلومات الشخصية من الأطفال بنية التصفح. إذا كنت تعتقد أننا
                قمنا بجمع معلومات من طفل دون سن الثالثة عشرة، يرجى الاتصال بنا
                على الفور.
              </p>
              <h4>التغييرات في سياسة الخصوصية</h4>
              <p>
                نحتفظ بالحق في تحديث أو تغيير سياسة الخصوصية في أي وقت. ستكون أي
                تغييرات فعالة فور نشر سياسة الخصوصية المحدثة على منصتنا.
              </p>
              <h4>اتصل بنا</h4>
              <p>
                إذا كان لديك أي أسئلة أو استفسارات حول سياسة الخصوصية لدينا،
                يرجى الاتصال بنا على{" "}
                <Link to="mailto:info@hodallnas.com">info@hodallnas.com</Link>
              </p>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default PrivacyPolicy;
