import React from "react";
import SectionHeader from "./../components/layout/SectionHeader";
import { useTranslation } from "react-i18next";

const TermsConditions = () => {
  const { t } = useTranslation();
  const backLinks = [
    {
      name: t("home"),
      path: "/"
    }
  ];
  return (
    <>
      <SectionHeader
        pageName={t("auth.termsAndCondition")}
        backLinks={backLinks}
      />
      <section className="terms_section">
        <div className="container">
          <div className="row">
            <div className="col-lg-9 col-12">
              <h4>1. قبول الشروط</h4>
              <p>
                باستخدام هذه المنصة، فإنك توافق على جميع الشروط والأحكام المنصوص
                عليها في هذه الاتفاقية. إذا كنت لا توافق على هذه الشروط، يرجى
                عدم استخدام المنصة.
              </p>
              <h4>2. الملكية الفكرية</h4>
              <p>
                جميع المحتويات الصوتية والمرئية والمقالات والمواد التي يتم
                تقديمها على هذه المنصة هي ملكية فكرية محفوظة للمنصة و/أو المحتوى
                الأصلي. يجب عدم استخدام هذه المواد بأي شكل من الأشكال دون الحصول
                على إذن صريح مسبق من المنصة.
              </p>
              <h4>3. الاشتراك والدفع</h4>
              <p>
                يجب على المستخدمين الاشتراك في المنصة للوصول إلى المحتوى الكامل،
                ويجب على المشتركين دفع الرسوم المطلوبة وفقًا للباقة التي
                اختاروها.
              </p>
              <h4>4. استخدام المواد</h4>
              <p>
                يُسمح باستخدام المواد المقدمة على المنصة لأغراض شخصية فقط ولا
                يجوز توزيعها أو بيعها أو تأجيرها أو نقلها إلى أي طرف آخر.
              </p>
              <h4>5. مسؤولية المحتوى</h4>
              <p>
                لا تتحمل المنصة أي مسؤولية عن أي ضرر مباشر أو غير مباشر ينتج عن
                استخدام أو عدم القدرة على استخدام المحتوى المقدم على المنصة.
              </p>
              <h4>6. تغييرات في الشروط</h4>
              <p>
                تحتفظ المنصة بالحق في تغيير شروط الاستخدام في أي وقت دون إشعار
                مسبق. يجب على المستخدمين مراجعة الشروط بشكل دوري لمتابعة
                التغييرات.
              </p>
              <h4>7. إنهاء الخدمة</h4>
              <p>
                تحتفظ المنصة بالحق في إنهاء خدماتها لأي مستخدم في أي وقت بدون
                إشعار مسبق إذا تم انتهاك أي من شروط الاستخدام.
              </p>
              <h4>8. القانون الواجب التطبيق</h4>
              <p>
                تخضع هذه الاتفاقية لقوانين الدولة التي يتم تقديم الخدمة فيها.
              </p>
              <h4>9. الاتصال</h4>
              <p>
                لأية استفسارات أو توضيحات بخصوص الشروط والأحكام، يرجى التواصل
                معنا عبر البريد الإلكتروني المخصص.
              </p>
              <p>
                يرجى مراجعة هذه الشروط والأحكام بعناية قبل استخدام المنصة، وإذا
                كان لديك أي استفسارات، فلا تتردد في الاتصال بنا.
              </p>
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default TermsConditions;
